HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_bf.h
/** \\brief  Offset for Ifx_DMA_BLK_CH_CHSR_Bits.CH */
#define IFX_DMA_BLK_CH_CHSR_CH_OFF (24)

/** \\brief  Length for Ifx_DMA_BLK_CH_CHSR_Bits.HTRE */
#define IFX_DMA_BLK_CH_CHSR_HTRE_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CH_CHSR_Bits.HTRE */
#define IFX_DMA_BLK_CH_CHSR_HTRE_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CH_CHSR_Bits.HTRE */
#define IFX_DMA_BLK_CH_CHSR_HTRE_OFF (25)

/** \\brief  Length for Ifx_DMA_BLK_CH_CHSR_Bits.ICH */
#define IFX_DMA_BLK_CH_CHSR_ICH_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CH_CHSR_Bits.ICH */
#define IFX_DMA_BLK_CH_CHSR_ICH_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CH_CHSR_Bits.ICH */
#define IFX_DMA_BLK_CH_CHSR_ICH_OFF (18)

/** \\brief  Length for Ifx_DMA_BLK_CH_CHSR_Bits.IPM */
#define IFX_DMA_BLK_CH_CHSR_IPM_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CH_CHSR_Bits.IPM */
#define IFX_DMA_BLK_CH_CHSR_IPM_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CH_CHSR_Bits.IPM */
#define IFX_DMA_BLK_CH_CHSR_IPM_OFF (19)

/** \\brief  Length for Ifx_DMA_BLK_CH_CHSR_Bits.LXO */
#define IFX_DMA_BLK_CH_CHSR_LXO_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CH_CHSR_Bits.LXO */
#define IFX_DMA_BLK_CH_CHSR_LXO_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CH_CHSR_Bits.LXO */
#define IFX_DMA_BLK_CH_CHSR_LXO_OFF (15)

/** \\brief  Length for Ifx_DMA_BLK_CH_CHSR_Bits.TCOUNT */
#define IFX_DMA_BLK_CH_CHSR_TCOUNT_LEN (14)

/** \\brief  Mask for Ifx_DMA_BLK_CH_CHSR_Bits.TCOUNT */
#define IFX_DMA_BLK_CH_CHSR_TCOUNT_MSK (0x3fff)

/** \\brief  Offset for Ifx_DMA_BLK_CH_CHSR_Bits.TCOUNT */
#define IFX_DMA_BLK_CH_CHSR_TCOUNT_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_CH_CHSR_Bits.TRL */
#define IFX_DMA_BLK_CH_CHSR_TRL_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CH_CHSR_Bits.TRL */
#define IFX_DMA_BLK_CH_CHSR_TRL_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CH_CHSR_Bits.TRL */
#define IFX_DMA_BLK_CH_CHSR_TRL_OFF (20)

/** \\brief  Length for Ifx_DMA_BLK_CH_CHSR_Bits.WRPD */
#define IFX_DMA_BLK_CH_CHSR_WRPD_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CH_CHSR_Bits.WRPD */
#define IFX_DMA_BLK_CH_CHSR_WRPD_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CH_CHSR_Bits.WRPD */
#define IFX_DMA_BLK_CH_CHSR_WRPD_OFF (17)

/** \\brief  Length for Ifx_DMA_BLK_CH_CHSR_Bits.WRPS */
#define IFX_DMA_BLK_CH_CHSR_WRPS_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CH_CHSR_Bits.WRPS */
#define IFX_DMA_BLK_CH_CHSR_WRPS_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CH_CHSR_Bits.WRPS */
#define IFX_DMA_BLK_CH_CHSR_WRPS_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_CH_DADR_Bits.DADR */
#define IFX_DMA_BLK_CH_DADR_DADR_LEN (32)

/** \\brief  Mask for Ifx_DMA_BLK_CH_DADR_Bits.DADR */
#define IFX_DMA_BLK_CH_DADR_DADR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_DMA_BLK_CH_DADR_Bits.DADR */
#define IFX_DMA_BLK_CH_DADR_DADR_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_CH_SADR_Bits.SADR */
#define IFX_DMA_BLK_CH_SADR_SADR_LEN (32)

/** \\brief  Mask for Ifx_DMA_BLK_CH_SADR_Bits.SADR */
#define IFX_DMA_BLK_CH_SADR_SADR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_DMA_BLK_CH_SADR_Bits.SADR */
#define IFX_DMA_BLK_CH_SADR_SADR_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_CH_SHADR_Bits.SHADR */
#define IFX_DMA_BLK_CH_SHADR_SHADR_LEN (32)

/** \\brief  Mask for Ifx_DMA_BLK_CH_SHADR_Bits.SHADR */
#define IFX_DMA_BLK_CH_SHADR_SHADR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_DMA_BLK_CH_SHADR_Bits.SHADR */
#define IFX_DMA_BLK_CH_SHADR_SHADR_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT0 */
#define IFX_DMA_BLK_CHINTR0_SIT0_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT0 */
#define IFX_DMA_BLK_CHINTR0_SIT0_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT0 */
#define IFX_DMA_BLK_CHINTR0_SIT0_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT10 */
#define IFX_DMA_BLK_CHINTR0_SIT10_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT10 */
#define IFX_DMA_BLK_CHINTR0_SIT10_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT10 */
#define IFX_DMA_BLK_CHINTR0_SIT10_OFF (10)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT11 */
#define IFX_DMA_BLK_CHINTR0_SIT11_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT11 */
#define IFX_DMA_BLK_CHINTR0_SIT11_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT11 */
#define IFX_DMA_BLK_CHINTR0_SIT11_OFF (11)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT12 */
#define IFX_DMA_BLK_CHINTR0_SIT12_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT12 */
#define IFX_DMA_BLK_CHINTR0_SIT12_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT12 */
#define IFX_DMA_BLK_CHINTR0_SIT12_OFF (12)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT13 */
#define IFX_DMA_BLK_CHINTR0_SIT13_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT13 */
#define IFX_DMA_BLK_CHINTR0_SIT13_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT13 */
#define IFX_DMA_BLK_CHINTR0_SIT13_OFF (13)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT14 */
#define IFX_DMA_BLK_CHINTR0_SIT14_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT14 */
#define IFX_DMA_BLK_CHINTR0_SIT14_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT14 */
#define IFX_DMA_BLK_CHINTR0_SIT14_OFF (14)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT15 */
#define IFX_DMA_BLK_CHINTR0_SIT15_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT15 */
#define IFX_DMA_BLK_CHINTR0_SIT15_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT15 */
#define IFX_DMA_BLK_CHINTR0_SIT15_OFF (15)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT16 */
#define IFX_DMA_BLK_CHINTR0_SIT16_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT16 */
#define IFX_DMA_BLK_CHINTR0_SIT16_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT16 */
#define IFX_DMA_BLK_CHINTR0_SIT16_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT17 */
#define IFX_DMA_BLK_CHINTR0_SIT17_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT17 */
#define IFX_DMA_BLK_CHINTR0_SIT17_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT17 */
#define IFX_DMA_BLK_CHINTR0_SIT17_OFF (17)

