HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_bf.h
/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT18 */
#define IFX_DMA_BLK_CHINTR0_SIT18_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT18 */
#define IFX_DMA_BLK_CHINTR0_SIT18_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT18 */
#define IFX_DMA_BLK_CHINTR0_SIT18_OFF (18)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT19 */
#define IFX_DMA_BLK_CHINTR0_SIT19_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT19 */
#define IFX_DMA_BLK_CHINTR0_SIT19_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT19 */
#define IFX_DMA_BLK_CHINTR0_SIT19_OFF (19)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT1 */
#define IFX_DMA_BLK_CHINTR0_SIT1_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT1 */
#define IFX_DMA_BLK_CHINTR0_SIT1_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT1 */
#define IFX_DMA_BLK_CHINTR0_SIT1_OFF (1)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT20 */
#define IFX_DMA_BLK_CHINTR0_SIT20_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT20 */
#define IFX_DMA_BLK_CHINTR0_SIT20_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT20 */
#define IFX_DMA_BLK_CHINTR0_SIT20_OFF (20)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT21 */
#define IFX_DMA_BLK_CHINTR0_SIT21_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT21 */
#define IFX_DMA_BLK_CHINTR0_SIT21_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT21 */
#define IFX_DMA_BLK_CHINTR0_SIT21_OFF (21)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT22 */
#define IFX_DMA_BLK_CHINTR0_SIT22_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT22 */
#define IFX_DMA_BLK_CHINTR0_SIT22_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT22 */
#define IFX_DMA_BLK_CHINTR0_SIT22_OFF (22)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT23 */
#define IFX_DMA_BLK_CHINTR0_SIT23_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT23 */
#define IFX_DMA_BLK_CHINTR0_SIT23_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT23 */
#define IFX_DMA_BLK_CHINTR0_SIT23_OFF (23)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT2 */
#define IFX_DMA_BLK_CHINTR0_SIT2_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT2 */
#define IFX_DMA_BLK_CHINTR0_SIT2_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT2 */
#define IFX_DMA_BLK_CHINTR0_SIT2_OFF (2)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT3 */
#define IFX_DMA_BLK_CHINTR0_SIT3_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT3 */
#define IFX_DMA_BLK_CHINTR0_SIT3_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT3 */
#define IFX_DMA_BLK_CHINTR0_SIT3_OFF (3)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT4 */
#define IFX_DMA_BLK_CHINTR0_SIT4_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT4 */
#define IFX_DMA_BLK_CHINTR0_SIT4_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT4 */
#define IFX_DMA_BLK_CHINTR0_SIT4_OFF (4)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT5 */
#define IFX_DMA_BLK_CHINTR0_SIT5_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT5 */
#define IFX_DMA_BLK_CHINTR0_SIT5_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT5 */
#define IFX_DMA_BLK_CHINTR0_SIT5_OFF (5)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT6 */
#define IFX_DMA_BLK_CHINTR0_SIT6_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT6 */
#define IFX_DMA_BLK_CHINTR0_SIT6_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT6 */
#define IFX_DMA_BLK_CHINTR0_SIT6_OFF (6)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT7 */
#define IFX_DMA_BLK_CHINTR0_SIT7_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT7 */
#define IFX_DMA_BLK_CHINTR0_SIT7_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT7 */
#define IFX_DMA_BLK_CHINTR0_SIT7_OFF (7)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT8 */
#define IFX_DMA_BLK_CHINTR0_SIT8_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT8 */
#define IFX_DMA_BLK_CHINTR0_SIT8_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT8 */
#define IFX_DMA_BLK_CHINTR0_SIT8_OFF (8)

/** \\brief  Length for Ifx_DMA_BLK_CHINTR0_Bits.SIT9 */
#define IFX_DMA_BLK_CHINTR0_SIT9_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHINTR0_Bits.SIT9 */
#define IFX_DMA_BLK_CHINTR0_SIT9_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHINTR0_Bits.SIT9 */
#define IFX_DMA_BLK_CHINTR0_SIT9_OFF (9)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH0 */
#define IFX_DMA_BLK_CHRSTR0_CH0_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH0 */
#define IFX_DMA_BLK_CHRSTR0_CH0_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH0 */
#define IFX_DMA_BLK_CHRSTR0_CH0_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH10 */
#define IFX_DMA_BLK_CHRSTR0_CH10_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH10 */
#define IFX_DMA_BLK_CHRSTR0_CH10_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH10 */
#define IFX_DMA_BLK_CHRSTR0_CH10_OFF (10)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH11 */
#define IFX_DMA_BLK_CHRSTR0_CH11_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH11 */
#define IFX_DMA_BLK_CHRSTR0_CH11_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH11 */
#define IFX_DMA_BLK_CHRSTR0_CH11_OFF (11)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH12 */
#define IFX_DMA_BLK_CHRSTR0_CH12_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH12 */
#define IFX_DMA_BLK_CHRSTR0_CH12_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH12 */
#define IFX_DMA_BLK_CHRSTR0_CH12_OFF (12)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH13 */
#define IFX_DMA_BLK_CHRSTR0_CH13_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH13 */
#define IFX_DMA_BLK_CHRSTR0_CH13_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH13 */
#define IFX_DMA_BLK_CHRSTR0_CH13_OFF (13)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH14 */
#define IFX_DMA_BLK_CHRSTR0_CH14_LEN (1)

