HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_bf.h
/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH14 */
#define IFX_DMA_BLK_CHRSTR0_CH14_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH14 */
#define IFX_DMA_BLK_CHRSTR0_CH14_OFF (14)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH15 */
#define IFX_DMA_BLK_CHRSTR0_CH15_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH15 */
#define IFX_DMA_BLK_CHRSTR0_CH15_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH15 */
#define IFX_DMA_BLK_CHRSTR0_CH15_OFF (15)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH16 */
#define IFX_DMA_BLK_CHRSTR0_CH16_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH16 */
#define IFX_DMA_BLK_CHRSTR0_CH16_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH16 */
#define IFX_DMA_BLK_CHRSTR0_CH16_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH17 */
#define IFX_DMA_BLK_CHRSTR0_CH17_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH17 */
#define IFX_DMA_BLK_CHRSTR0_CH17_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH17 */
#define IFX_DMA_BLK_CHRSTR0_CH17_OFF (17)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH18 */
#define IFX_DMA_BLK_CHRSTR0_CH18_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH18 */
#define IFX_DMA_BLK_CHRSTR0_CH18_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH18 */
#define IFX_DMA_BLK_CHRSTR0_CH18_OFF (18)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH19 */
#define IFX_DMA_BLK_CHRSTR0_CH19_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH19 */
#define IFX_DMA_BLK_CHRSTR0_CH19_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH19 */
#define IFX_DMA_BLK_CHRSTR0_CH19_OFF (19)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH1 */
#define IFX_DMA_BLK_CHRSTR0_CH1_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH1 */
#define IFX_DMA_BLK_CHRSTR0_CH1_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH1 */
#define IFX_DMA_BLK_CHRSTR0_CH1_OFF (1)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH20 */
#define IFX_DMA_BLK_CHRSTR0_CH20_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH20 */
#define IFX_DMA_BLK_CHRSTR0_CH20_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH20 */
#define IFX_DMA_BLK_CHRSTR0_CH20_OFF (20)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH21 */
#define IFX_DMA_BLK_CHRSTR0_CH21_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH21 */
#define IFX_DMA_BLK_CHRSTR0_CH21_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH21 */
#define IFX_DMA_BLK_CHRSTR0_CH21_OFF (21)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH22 */
#define IFX_DMA_BLK_CHRSTR0_CH22_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH22 */
#define IFX_DMA_BLK_CHRSTR0_CH22_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH22 */
#define IFX_DMA_BLK_CHRSTR0_CH22_OFF (22)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH23 */
#define IFX_DMA_BLK_CHRSTR0_CH23_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH23 */
#define IFX_DMA_BLK_CHRSTR0_CH23_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH23 */
#define IFX_DMA_BLK_CHRSTR0_CH23_OFF (23)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH2 */
#define IFX_DMA_BLK_CHRSTR0_CH2_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH2 */
#define IFX_DMA_BLK_CHRSTR0_CH2_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH2 */
#define IFX_DMA_BLK_CHRSTR0_CH2_OFF (2)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH3 */
#define IFX_DMA_BLK_CHRSTR0_CH3_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH3 */
#define IFX_DMA_BLK_CHRSTR0_CH3_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH3 */
#define IFX_DMA_BLK_CHRSTR0_CH3_OFF (3)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH4 */
#define IFX_DMA_BLK_CHRSTR0_CH4_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH4 */
#define IFX_DMA_BLK_CHRSTR0_CH4_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH4 */
#define IFX_DMA_BLK_CHRSTR0_CH4_OFF (4)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH5 */
#define IFX_DMA_BLK_CHRSTR0_CH5_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH5 */
#define IFX_DMA_BLK_CHRSTR0_CH5_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH5 */
#define IFX_DMA_BLK_CHRSTR0_CH5_OFF (5)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH6 */
#define IFX_DMA_BLK_CHRSTR0_CH6_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH6 */
#define IFX_DMA_BLK_CHRSTR0_CH6_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH6 */
#define IFX_DMA_BLK_CHRSTR0_CH6_OFF (6)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH7 */
#define IFX_DMA_BLK_CHRSTR0_CH7_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH7 */
#define IFX_DMA_BLK_CHRSTR0_CH7_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH7 */
#define IFX_DMA_BLK_CHRSTR0_CH7_OFF (7)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH8 */
#define IFX_DMA_BLK_CHRSTR0_CH8_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH8 */
#define IFX_DMA_BLK_CHRSTR0_CH8_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH8 */
#define IFX_DMA_BLK_CHRSTR0_CH8_OFF (8)

/** \\brief  Length for Ifx_DMA_BLK_CHRSTR0_Bits.CH9 */
#define IFX_DMA_BLK_CHRSTR0_CH9_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CHRSTR0_Bits.CH9 */
#define IFX_DMA_BLK_CHRSTR0_CH9_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CHRSTR0_Bits.CH9 */
#define IFX_DMA_BLK_CHRSTR0_CH9_OFF (9)

/** \\brief  Length for Ifx_DMA_BLK_CLRE_Bits.CFPIER */
#define IFX_DMA_BLK_CLRE_CFPIER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CLRE_Bits.CFPIER */
#define IFX_DMA_BLK_CLRE_CFPIER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CLRE_Bits.CFPIER */
#define IFX_DMA_BLK_CLRE_CFPIER_OFF (20)

/** \\brief  Length for Ifx_DMA_BLK_CLRE_Bits.CMExDER */
#define IFX_DMA_BLK_CLRE_CMEXDER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CLRE_Bits.CMExDER */
#define IFX_DMA_BLK_CLRE_CMEXDER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CLRE_Bits.CMExDER */
#define IFX_DMA_BLK_CLRE_CMEXDER_OFF (17)

/** \\brief  Length for Ifx_DMA_BLK_CLRE_Bits.CMExSER */
#define IFX_DMA_BLK_CLRE_CMEXSER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CLRE_Bits.CMExSER */
#define IFX_DMA_BLK_CLRE_CMEXSER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CLRE_Bits.CMExSER */
#define IFX_DMA_BLK_CLRE_CMEXSER_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_CLRE_Bits.CPERER */
#define IFX_DMA_BLK_CLRE_CPERER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CLRE_Bits.CPERER */
#define IFX_DMA_BLK_CLRE_CPERER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CLRE_Bits.CPERER */
#define IFX_DMA_BLK_CLRE_CPERER_OFF (22)

/** \\brief  Length for Ifx_DMA_BLK_CLRE_Bits.CSRIER */
#define IFX_DMA_BLK_CLRE_CSRIER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CLRE_Bits.CSRIER */
#define IFX_DMA_BLK_CLRE_CSRIER_MSK (0x1)

