HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_bf.h
/** \\brief  Offset for Ifx_DMA_BLK_CLRE_Bits.CSRIER */
#define IFX_DMA_BLK_CLRE_CSRIER_OFF (21)

/** \\brief  Length for Ifx_DMA_BLK_EER_Bits.EDER */
#define IFX_DMA_BLK_EER_EDER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_EER_Bits.EDER */
#define IFX_DMA_BLK_EER_EDER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_EER_Bits.EDER */
#define IFX_DMA_BLK_EER_EDER_OFF (17)

/** \\brief  Length for Ifx_DMA_BLK_EER_Bits.ESER */
#define IFX_DMA_BLK_EER_ESER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_EER_Bits.ESER */
#define IFX_DMA_BLK_EER_ESER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_EER_Bits.ESER */
#define IFX_DMA_BLK_EER_ESER_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.DER */
#define IFX_DMA_BLK_ERRSR_DER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.DER */
#define IFX_DMA_BLK_ERRSR_DER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.DER */
#define IFX_DMA_BLK_ERRSR_DER_OFF (17)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.FPIER */
#define IFX_DMA_BLK_ERRSR_FPIER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.FPIER */
#define IFX_DMA_BLK_ERRSR_FPIER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.FPIER */
#define IFX_DMA_BLK_ERRSR_FPIER_OFF (20)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.LEC */
#define IFX_DMA_BLK_ERRSR_LEC_LEN (6)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.LEC */
#define IFX_DMA_BLK_ERRSR_LEC_MSK (0x3f)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.LEC */
#define IFX_DMA_BLK_ERRSR_LEC_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.PERER */
#define IFX_DMA_BLK_ERRSR_PERER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.PERER */
#define IFX_DMA_BLK_ERRSR_PERER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.PERER */
#define IFX_DMA_BLK_ERRSR_PERER_OFF (22)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.SER */
#define IFX_DMA_BLK_ERRSR_SER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.SER */
#define IFX_DMA_BLK_ERRSR_SER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.SER */
#define IFX_DMA_BLK_ERRSR_SER_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.SRIER */
#define IFX_DMA_BLK_ERRSR_SRIER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.SRIER */
#define IFX_DMA_BLK_ERRSR_SRIER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.SRIER */
#define IFX_DMA_BLK_ERRSR_SRIER_OFF (21)

/** \\brief  Length for Ifx_DMA_BLK_ME_INTR_Bits.SIT */
#define IFX_DMA_BLK_ME_INTR_SIT_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_INTR_Bits.SIT */
#define IFX_DMA_BLK_ME_INTR_SIT_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_INTR_Bits.SIT */
#define IFX_DMA_BLK_ME_INTR_SIT_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_PR_Bits.PAT00 */
#define IFX_DMA_BLK_ME_PR_PAT00_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_PR_Bits.PAT00 */
#define IFX_DMA_BLK_ME_PR_PAT00_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_PR_Bits.PAT00 */
#define IFX_DMA_BLK_ME_PR_PAT00_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_PR_Bits.PAT01 */
#define IFX_DMA_BLK_ME_PR_PAT01_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_PR_Bits.PAT01 */
#define IFX_DMA_BLK_ME_PR_PAT01_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_PR_Bits.PAT01 */
#define IFX_DMA_BLK_ME_PR_PAT01_OFF (8)

/** \\brief  Length for Ifx_DMA_BLK_ME_PR_Bits.PAT02 */
#define IFX_DMA_BLK_ME_PR_PAT02_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_PR_Bits.PAT02 */
#define IFX_DMA_BLK_ME_PR_PAT02_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_PR_Bits.PAT02 */
#define IFX_DMA_BLK_ME_PR_PAT02_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ME_PR_Bits.PAT03 */
#define IFX_DMA_BLK_ME_PR_PAT03_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_PR_Bits.PAT03 */
#define IFX_DMA_BLK_ME_PR_PAT03_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_PR_Bits.PAT03 */
#define IFX_DMA_BLK_ME_PR_PAT03_OFF (24)

/** \\brief  Length for Ifx_DMA_BLK_ME_R_Bits.RD00 */
#define IFX_DMA_BLK_ME_R_RD00_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R_Bits.RD00 */
#define IFX_DMA_BLK_ME_R_RD00_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R_Bits.RD00 */
#define IFX_DMA_BLK_ME_R_RD00_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_R_Bits.RD01 */
#define IFX_DMA_BLK_ME_R_RD01_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R_Bits.RD01 */
#define IFX_DMA_BLK_ME_R_RD01_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R_Bits.RD01 */
#define IFX_DMA_BLK_ME_R_RD01_OFF (8)

/** \\brief  Length for Ifx_DMA_BLK_ME_R_Bits.RD02 */
#define IFX_DMA_BLK_ME_R_RD02_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R_Bits.RD02 */
#define IFX_DMA_BLK_ME_R_RD02_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R_Bits.RD02 */
#define IFX_DMA_BLK_ME_R_RD02_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ME_R_Bits.RD03 */
#define IFX_DMA_BLK_ME_R_RD03_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R_Bits.RD03 */
#define IFX_DMA_BLK_ME_R_RD03_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R_Bits.RD03 */
#define IFX_DMA_BLK_ME_R_RD03_OFF (24)

/** \\brief  Length for Ifx_DMA_BLK_ME_SR_Bits.CH */
#define IFX_DMA_BLK_ME_SR_CH_LEN (6)

/** \\brief  Mask for Ifx_DMA_BLK_ME_SR_Bits.CH */
#define IFX_DMA_BLK_ME_SR_CH_MSK (0x3f)

/** \\brief  Offset for Ifx_DMA_BLK_ME_SR_Bits.CH */
#define IFX_DMA_BLK_ME_SR_CH_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ME_SR_Bits.RS */
#define IFX_DMA_BLK_ME_SR_RS_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_SR_Bits.RS */
#define IFX_DMA_BLK_ME_SR_RS_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_SR_Bits.RS */
#define IFX_DMA_BLK_ME_SR_RS_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_SR_Bits.WS */
#define IFX_DMA_BLK_ME_SR_WS_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_SR_Bits.WS */
#define IFX_DMA_BLK_ME_SR_WS_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_SR_Bits.WS */
#define IFX_DMA_BLK_ME_SR_WS_OFF (4)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC0 */
#define IFX_DMA_BLK_SUSACR0_SUSAC0_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC0 */
#define IFX_DMA_BLK_SUSACR0_SUSAC0_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC0 */
#define IFX_DMA_BLK_SUSACR0_SUSAC0_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC10 */
#define IFX_DMA_BLK_SUSACR0_SUSAC10_LEN (1)

