HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_bf.h
/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC10 */
#define IFX_DMA_BLK_SUSACR0_SUSAC10_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC10 */
#define IFX_DMA_BLK_SUSACR0_SUSAC10_OFF (10)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC11 */
#define IFX_DMA_BLK_SUSACR0_SUSAC11_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC11 */
#define IFX_DMA_BLK_SUSACR0_SUSAC11_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC11 */
#define IFX_DMA_BLK_SUSACR0_SUSAC11_OFF (11)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC12 */
#define IFX_DMA_BLK_SUSACR0_SUSAC12_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC12 */
#define IFX_DMA_BLK_SUSACR0_SUSAC12_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC12 */
#define IFX_DMA_BLK_SUSACR0_SUSAC12_OFF (12)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC13 */
#define IFX_DMA_BLK_SUSACR0_SUSAC13_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC13 */
#define IFX_DMA_BLK_SUSACR0_SUSAC13_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC13 */
#define IFX_DMA_BLK_SUSACR0_SUSAC13_OFF (13)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC14 */
#define IFX_DMA_BLK_SUSACR0_SUSAC14_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC14 */
#define IFX_DMA_BLK_SUSACR0_SUSAC14_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC14 */
#define IFX_DMA_BLK_SUSACR0_SUSAC14_OFF (14)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC15 */
#define IFX_DMA_BLK_SUSACR0_SUSAC15_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC15 */
#define IFX_DMA_BLK_SUSACR0_SUSAC15_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC15 */
#define IFX_DMA_BLK_SUSACR0_SUSAC15_OFF (15)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC16 */
#define IFX_DMA_BLK_SUSACR0_SUSAC16_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC16 */
#define IFX_DMA_BLK_SUSACR0_SUSAC16_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC16 */
#define IFX_DMA_BLK_SUSACR0_SUSAC16_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC17 */
#define IFX_DMA_BLK_SUSACR0_SUSAC17_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC17 */
#define IFX_DMA_BLK_SUSACR0_SUSAC17_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC17 */
#define IFX_DMA_BLK_SUSACR0_SUSAC17_OFF (17)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC18 */
#define IFX_DMA_BLK_SUSACR0_SUSAC18_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC18 */
#define IFX_DMA_BLK_SUSACR0_SUSAC18_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC18 */
#define IFX_DMA_BLK_SUSACR0_SUSAC18_OFF (18)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC19 */
#define IFX_DMA_BLK_SUSACR0_SUSAC19_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC19 */
#define IFX_DMA_BLK_SUSACR0_SUSAC19_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC19 */
#define IFX_DMA_BLK_SUSACR0_SUSAC19_OFF (19)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC1 */
#define IFX_DMA_BLK_SUSACR0_SUSAC1_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC1 */
#define IFX_DMA_BLK_SUSACR0_SUSAC1_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC1 */
#define IFX_DMA_BLK_SUSACR0_SUSAC1_OFF (1)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC20 */
#define IFX_DMA_BLK_SUSACR0_SUSAC20_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC20 */
#define IFX_DMA_BLK_SUSACR0_SUSAC20_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC20 */
#define IFX_DMA_BLK_SUSACR0_SUSAC20_OFF (20)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC21 */
#define IFX_DMA_BLK_SUSACR0_SUSAC21_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC21 */
#define IFX_DMA_BLK_SUSACR0_SUSAC21_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC21 */
#define IFX_DMA_BLK_SUSACR0_SUSAC21_OFF (21)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC22 */
#define IFX_DMA_BLK_SUSACR0_SUSAC22_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC22 */
#define IFX_DMA_BLK_SUSACR0_SUSAC22_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC22 */
#define IFX_DMA_BLK_SUSACR0_SUSAC22_OFF (22)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC23 */
#define IFX_DMA_BLK_SUSACR0_SUSAC23_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC23 */
#define IFX_DMA_BLK_SUSACR0_SUSAC23_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC23 */
#define IFX_DMA_BLK_SUSACR0_SUSAC23_OFF (23)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC2 */
#define IFX_DMA_BLK_SUSACR0_SUSAC2_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC2 */
#define IFX_DMA_BLK_SUSACR0_SUSAC2_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC2 */
#define IFX_DMA_BLK_SUSACR0_SUSAC2_OFF (2)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC3 */
#define IFX_DMA_BLK_SUSACR0_SUSAC3_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC3 */
#define IFX_DMA_BLK_SUSACR0_SUSAC3_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC3 */
#define IFX_DMA_BLK_SUSACR0_SUSAC3_OFF (3)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC4 */
#define IFX_DMA_BLK_SUSACR0_SUSAC4_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC4 */
#define IFX_DMA_BLK_SUSACR0_SUSAC4_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC4 */
#define IFX_DMA_BLK_SUSACR0_SUSAC4_OFF (4)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC5 */
#define IFX_DMA_BLK_SUSACR0_SUSAC5_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC5 */
#define IFX_DMA_BLK_SUSACR0_SUSAC5_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC5 */
#define IFX_DMA_BLK_SUSACR0_SUSAC5_OFF (5)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC6 */
#define IFX_DMA_BLK_SUSACR0_SUSAC6_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC6 */
#define IFX_DMA_BLK_SUSACR0_SUSAC6_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC6 */
#define IFX_DMA_BLK_SUSACR0_SUSAC6_OFF (6)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC7 */
#define IFX_DMA_BLK_SUSACR0_SUSAC7_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC7 */
#define IFX_DMA_BLK_SUSACR0_SUSAC7_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC7 */
#define IFX_DMA_BLK_SUSACR0_SUSAC7_OFF (7)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC8 */
#define IFX_DMA_BLK_SUSACR0_SUSAC8_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC8 */
#define IFX_DMA_BLK_SUSACR0_SUSAC8_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC8 */
#define IFX_DMA_BLK_SUSACR0_SUSAC8_OFF (8)

/** \\brief  Length for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC9 */
#define IFX_DMA_BLK_SUSACR0_SUSAC9_LEN (1)

