HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_bf.h
/** \\brief  Mask for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC9 */
#define IFX_DMA_BLK_SUSACR0_SUSAC9_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSACR0_Bits.SUSAC9 */
#define IFX_DMA_BLK_SUSACR0_SUSAC9_OFF (9)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN0 */
#define IFX_DMA_BLK_SUSENR0_SUSEN0_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN0 */
#define IFX_DMA_BLK_SUSENR0_SUSEN0_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN0 */
#define IFX_DMA_BLK_SUSENR0_SUSEN0_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN10 */
#define IFX_DMA_BLK_SUSENR0_SUSEN10_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN10 */
#define IFX_DMA_BLK_SUSENR0_SUSEN10_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN10 */
#define IFX_DMA_BLK_SUSENR0_SUSEN10_OFF (10)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN11 */
#define IFX_DMA_BLK_SUSENR0_SUSEN11_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN11 */
#define IFX_DMA_BLK_SUSENR0_SUSEN11_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN11 */
#define IFX_DMA_BLK_SUSENR0_SUSEN11_OFF (11)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN12 */
#define IFX_DMA_BLK_SUSENR0_SUSEN12_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN12 */
#define IFX_DMA_BLK_SUSENR0_SUSEN12_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN12 */
#define IFX_DMA_BLK_SUSENR0_SUSEN12_OFF (12)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN13 */
#define IFX_DMA_BLK_SUSENR0_SUSEN13_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN13 */
#define IFX_DMA_BLK_SUSENR0_SUSEN13_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN13 */
#define IFX_DMA_BLK_SUSENR0_SUSEN13_OFF (13)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN14 */
#define IFX_DMA_BLK_SUSENR0_SUSEN14_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN14 */
#define IFX_DMA_BLK_SUSENR0_SUSEN14_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN14 */
#define IFX_DMA_BLK_SUSENR0_SUSEN14_OFF (14)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN15 */
#define IFX_DMA_BLK_SUSENR0_SUSEN15_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN15 */
#define IFX_DMA_BLK_SUSENR0_SUSEN15_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN15 */
#define IFX_DMA_BLK_SUSENR0_SUSEN15_OFF (15)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN16 */
#define IFX_DMA_BLK_SUSENR0_SUSEN16_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN16 */
#define IFX_DMA_BLK_SUSENR0_SUSEN16_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN16 */
#define IFX_DMA_BLK_SUSENR0_SUSEN16_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN17 */
#define IFX_DMA_BLK_SUSENR0_SUSEN17_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN17 */
#define IFX_DMA_BLK_SUSENR0_SUSEN17_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN17 */
#define IFX_DMA_BLK_SUSENR0_SUSEN17_OFF (17)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN18 */
#define IFX_DMA_BLK_SUSENR0_SUSEN18_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN18 */
#define IFX_DMA_BLK_SUSENR0_SUSEN18_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN18 */
#define IFX_DMA_BLK_SUSENR0_SUSEN18_OFF (18)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN19 */
#define IFX_DMA_BLK_SUSENR0_SUSEN19_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN19 */
#define IFX_DMA_BLK_SUSENR0_SUSEN19_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN19 */
#define IFX_DMA_BLK_SUSENR0_SUSEN19_OFF (19)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN1 */
#define IFX_DMA_BLK_SUSENR0_SUSEN1_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN1 */
#define IFX_DMA_BLK_SUSENR0_SUSEN1_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN1 */
#define IFX_DMA_BLK_SUSENR0_SUSEN1_OFF (1)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN20 */
#define IFX_DMA_BLK_SUSENR0_SUSEN20_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN20 */
#define IFX_DMA_BLK_SUSENR0_SUSEN20_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN20 */
#define IFX_DMA_BLK_SUSENR0_SUSEN20_OFF (20)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN21 */
#define IFX_DMA_BLK_SUSENR0_SUSEN21_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN21 */
#define IFX_DMA_BLK_SUSENR0_SUSEN21_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN21 */
#define IFX_DMA_BLK_SUSENR0_SUSEN21_OFF (21)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN22 */
#define IFX_DMA_BLK_SUSENR0_SUSEN22_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN22 */
#define IFX_DMA_BLK_SUSENR0_SUSEN22_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN22 */
#define IFX_DMA_BLK_SUSENR0_SUSEN22_OFF (22)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN23 */
#define IFX_DMA_BLK_SUSENR0_SUSEN23_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN23 */
#define IFX_DMA_BLK_SUSENR0_SUSEN23_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN23 */
#define IFX_DMA_BLK_SUSENR0_SUSEN23_OFF (23)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN2 */
#define IFX_DMA_BLK_SUSENR0_SUSEN2_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN2 */
#define IFX_DMA_BLK_SUSENR0_SUSEN2_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN2 */
#define IFX_DMA_BLK_SUSENR0_SUSEN2_OFF (2)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN3 */
#define IFX_DMA_BLK_SUSENR0_SUSEN3_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN3 */
#define IFX_DMA_BLK_SUSENR0_SUSEN3_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN3 */
#define IFX_DMA_BLK_SUSENR0_SUSEN3_OFF (3)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN4 */
#define IFX_DMA_BLK_SUSENR0_SUSEN4_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN4 */
#define IFX_DMA_BLK_SUSENR0_SUSEN4_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN4 */
#define IFX_DMA_BLK_SUSENR0_SUSEN4_OFF (4)

