HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_bf.h
/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN5 */
#define IFX_DMA_BLK_SUSENR0_SUSEN5_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN5 */
#define IFX_DMA_BLK_SUSENR0_SUSEN5_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN5 */
#define IFX_DMA_BLK_SUSENR0_SUSEN5_OFF (5)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN6 */
#define IFX_DMA_BLK_SUSENR0_SUSEN6_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN6 */
#define IFX_DMA_BLK_SUSENR0_SUSEN6_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN6 */
#define IFX_DMA_BLK_SUSENR0_SUSEN6_OFF (6)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN7 */
#define IFX_DMA_BLK_SUSENR0_SUSEN7_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN7 */
#define IFX_DMA_BLK_SUSENR0_SUSEN7_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN7 */
#define IFX_DMA_BLK_SUSENR0_SUSEN7_OFF (7)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN8 */
#define IFX_DMA_BLK_SUSENR0_SUSEN8_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN8 */
#define IFX_DMA_BLK_SUSENR0_SUSEN8_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN8 */
#define IFX_DMA_BLK_SUSENR0_SUSEN8_OFF (8)

/** \\brief  Length for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN9 */
#define IFX_DMA_BLK_SUSENR0_SUSEN9_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN9 */
#define IFX_DMA_BLK_SUSENR0_SUSEN9_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_SUSENR0_Bits.SUSEN9 */
#define IFX_DMA_BLK_SUSENR0_SUSEN9_OFF (9)

/** \\brief  Length for Ifx_DMA_CLC0_Bits.DISR */
#define IFX_DMA_CLC0_DISR_LEN (1)

/** \\brief  Mask for Ifx_DMA_CLC0_Bits.DISR */
#define IFX_DMA_CLC0_DISR_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_CLC0_Bits.DISR */
#define IFX_DMA_CLC0_DISR_OFF (0)

/** \\brief  Length for Ifx_DMA_CLC0_Bits.DISS */
#define IFX_DMA_CLC0_DISS_LEN (1)

/** \\brief  Mask for Ifx_DMA_CLC0_Bits.DISS */
#define IFX_DMA_CLC0_DISS_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_CLC0_Bits.DISS */
#define IFX_DMA_CLC0_DISS_OFF (1)

/** \\brief  Length for Ifx_DMA_CLC0_Bits.EDIS */
#define IFX_DMA_CLC0_EDIS_LEN (1)

/** \\brief  Mask for Ifx_DMA_CLC0_Bits.EDIS */
#define IFX_DMA_CLC0_EDIS_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_CLC0_Bits.EDIS */
#define IFX_DMA_CLC0_EDIS_OFF (3)

/** \\brief  Length for Ifx_DMA_CLC1_Bits.DISR */
#define IFX_DMA_CLC1_DISR_LEN (1)

/** \\brief  Mask for Ifx_DMA_CLC1_Bits.DISR */
#define IFX_DMA_CLC1_DISR_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_CLC1_Bits.DISR */
#define IFX_DMA_CLC1_DISR_OFF (0)

/** \\brief  Length for Ifx_DMA_CLC1_Bits.DISS */
#define IFX_DMA_CLC1_DISS_LEN (1)

/** \\brief  Mask for Ifx_DMA_CLC1_Bits.DISS */
#define IFX_DMA_CLC1_DISS_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_CLC1_Bits.DISS */
#define IFX_DMA_CLC1_DISS_OFF (1)

/** \\brief  Length for Ifx_DMA_CLC1_Bits.EDIS */
#define IFX_DMA_CLC1_EDIS_LEN (1)

/** \\brief  Mask for Ifx_DMA_CLC1_Bits.EDIS */
#define IFX_DMA_CLC1_EDIS_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_CLC1_Bits.EDIS */
#define IFX_DMA_CLC1_EDIS_OFF (3)

/** \\brief  Length for Ifx_DMA_ID_Bits.MODNUMBER */
#define IFX_DMA_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_DMA_ID_Bits.MODNUMBER */
#define IFX_DMA_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_DMA_ID_Bits.MODNUMBER */
#define IFX_DMA_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_DMA_ID_Bits.MODREV */
#define IFX_DMA_ID_MODREV_LEN (8)

/** \\brief  Mask for Ifx_DMA_ID_Bits.MODREV */
#define IFX_DMA_ID_MODREV_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_ID_Bits.MODREV */
#define IFX_DMA_ID_MODREV_OFF (0)

/** \\brief  Length for Ifx_DMA_ID_Bits.MODTYPE */
#define IFX_DMA_ID_MODTYPE_LEN (8)

/** \\brief  Mask for Ifx_DMA_ID_Bits.MODTYPE */
#define IFX_DMA_ID_MODTYPE_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_ID_Bits.MODTYPE */
#define IFX_DMA_ID_MODTYPE_OFF (8)

/** \\brief  Length for Ifx_DMA_OTSS_Bits.BS */
#define IFX_DMA_OTSS_BS_LEN (1)

/** \\brief  Mask for Ifx_DMA_OTSS_Bits.BS */
#define IFX_DMA_OTSS_BS_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_OTSS_Bits.BS */
#define IFX_DMA_OTSS_BS_OFF (7)

/** \\brief  Length for Ifx_DMA_OTSS_Bits.TGS */
#define IFX_DMA_OTSS_TGS_LEN (4)

/** \\brief  Mask for Ifx_DMA_OTSS_Bits.TGS */
#define IFX_DMA_OTSS_TGS_MSK (0xf)

/** \\brief  Offset for Ifx_DMA_OTSS_Bits.TGS */
#define IFX_DMA_OTSS_TGS_OFF (0)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXDMA_BF_H */
